app/controllers/school_classes_controller.rb

SELECT "school_classes".* FROM "school_classes"
---
  def index
    @classes = SchoolClass.all

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Test me"], ["room_number", 55], ["created_at", "2019-03-16 17:32:07.578182"], ["updated_at", "2019-03-16 17:32:07.578182"]]
---
  def create
    @cla = SchoolClass.create(title: params[:school_class_title], room_number: params[:school_class_room_number])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @cla = SchoolClass.find(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @cla = SchoolClass.find(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Math"], ["room_number", 3], ["updated_at", "2019-03-16 18:02:04.689257"], ["id", 2]]
---
  def update
    @cla = SchoolClass.find(params[:id])
    @cla.update(post_params(:title, :room_number))