app/controllers/students_controller.rb

  def create
    @student = Student.create(first_name: params[:student_first_name], last_name: params[:student_last_name])
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Balex"], ["last_name", "Calint"], ["created_at", "2019-03-16 17:45:18.074167"], ["updated_at", "2019-03-16 17:45:18.074167"]]

  def update
    @student = Student.find(params[:id])
    @student.update(post_params(:first_name, :last_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Ale"], ["last_name", "Jinn"], ["updated_at", "2019-03-16 18:09:50.578064"], ["id", 1]]